In [6]:
print("Pandas")

Pandas

In [8]:
import pandas as pd
import numpy as np

array = np.random.uniform(-10, 10, size =[4,4])
df = pd.DataFrame(array, index=["A", "B", "C", "D"], columns = ["W", "X", "Y", "Z"])

# Corregir el Ã­ndice para que sea un MultiIndex


print(df)

          W         X         Y         Z
A  2.082860  9.436669 -3.867642 -5.049920
B -7.724710  2.294736  6.508706 -8.003687
C -4.816819 -6.754739 -0.516077 -5.175858
D  2.151783  4.208750  2.208713 -7.222983

In [9]:
print(df)

          W         X         Y         Z
A  2.082860  9.436669 -3.867642 -5.049920
B -7.724710  2.294736  6.508706 -8.003687
C -4.816819 -6.754739 -0.516077 -5.175858
D  2.151783  4.208750  2.208713 -7.222983

In [10]:
df ["X"]

A    9.436669
B    2.294736
C   -6.754739
D    4.208750
Name: X, dtype: float64

In [13]:
df [["Y", "Z"]]

          Y         Z
A -3.867642 -5.049920
B  6.508706 -8.003687
C -0.516077 -5.175858
D  2.208713 -7.222983

In [14]:
df["TOTAL"] = df["W"] + df["X"] + df["Y"]+ df["Z"]
df

          W         X         Y         Z      TOTAL
A  2.082860  9.436669 -3.867642 -5.049920   2.601968
B -7.724710  2.294736  6.508706 -8.003687  -6.924955
C -4.816819 -6.754739 -0.516077 -5.175858 -17.263493
D  2.151783  4.208750  2.208713 -7.222983   1.346263

In [15]:
#Borrar columna
df.drop("TOTAL", axis=1)

          W         X         Y         Z
A  2.082860  9.436669 -3.867642 -5.049920
B -7.724710  2.294736  6.508706 -8.003687
C -4.816819 -6.754739 -0.516077 -5.175858
D  2.151783  4.208750  2.208713 -7.222983

In [16]:
df

          W         X         Y         Z      TOTAL
A  2.082860  9.436669 -3.867642 -5.049920   2.601968
B -7.724710  2.294736  6.508706 -8.003687  -6.924955
C -4.816819 -6.754739 -0.516077 -5.175858 -17.263493
D  2.151783  4.208750  2.208713 -7.222983   1.346263

In [17]:
df.drop("TOTAL", axis=1, inplace = True)

In [18]:
df

          W         X         Y         Z
A  2.082860  9.436669 -3.867642 -5.049920
B -7.724710  2.294736  6.508706 -8.003687
C -4.816819 -6.754739 -0.516077 -5.175858
D  2.151783  4.208750  2.208713 -7.222983

In [19]:

df.drop("D", axis=0)

          W         X         Y         Z
A  2.082860  9.436669 -3.867642 -5.049920
B -7.724710  2.294736  6.508706 -8.003687
C -4.816819 -6.754739 -0.516077 -5.175858

In [20]:
df.loc["C"]

W   -4.816819
X   -6.754739
Y   -0.516077
Z   -5.175858
Name: C, dtype: float64

In [22]:
df.loc["A", "W"]

2.082860253216447

In [23]:
df>0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True  False
C  False  False  False  False
D   True   True   True  False

In [24]:
df[df>0]

          W         X         Y   Z
A  2.082860  9.436669       NaN NaN
B       NaN  2.294736  6.508706 NaN
C       NaN       NaN       NaN NaN
D  2.151783  4.208750  2.208713 NaN

In [28]:
df[df["X"]>0][["Y","Z"]]

          Y         Z
A -3.867642 -5.049920
B  6.508706 -8.003687
D  2.208713 -7.222983

In [29]:
][ÃÂ¨*]_:Â°!"#$%&/()=?Â¡_:-:;MÃ[]"

SyntaxError: unmatched ']' (3483229770.py, line 1)

In [37]:
df[(df["X"]>0) | (df["Z"])<0)]

SyntaxError: closing parenthesis ')' does not match opening parenthesis '[' (543596436.py, line 1)

In [38]:
df[(df["X"] > 0) | (df["Z"] < 0)][["W", "Y"]]

          W         Y
A  2.082860 -3.867642
B -7.724710  6.508706
C -4.816819 -0.516077
D  2.151783  2.208713